## MySQL to Pandas Example

- Pandas can seamlessly integrate with MySQL to allow us to query our databases directly, and pull that information into a DataFrame

- Will utilize SQLAlchemy to connect & query MySQL databases 
    - Install SQLAlchemy by running pip install sqlalchemy

    - Install MySQLdb by running pip install mysqlclient

    - You will need to restart VSCode after installing before below imports will be recognized

In [10]:
import pandas as pd
import sqlalchemy as sql
import MySQLdb

### Setting up connection to the MySQL database using SQLAlchemy

The connection_string consists of several pieces, with the general format of:

connect_string = 'mysql://root:PASSWORD@localhost/DB_TO_ACCESS'

- root represents the USER we will use to connect to MySQL

- PASSWORD represents your unique MySQL password

- @localhost represents the host for MySQL

- DB_TO_ACCESS represents the database within MySQL that you would like to connect to

In [11]:
try:
    # Creating our Connection String
    connection_string = 'mysql://root:Homestar1!@localhost/school_db'
    # Creating our SQL engine using connection_string
    sql_engine = sql.create_engine(connection_string)
    # Our raw SQL query, in this example will pull all records from the table school_db_course
    query = "SELECT * from school_db_course"
    # Combining our query and engine together, and bringing the resulting data into a Pandas DataFrame
    dataframe = pd.read_sql_query(query,sql_engine)

except Exception as err:
    print(str(err)) # If we encounter any issues, print error messages to the terminal

Our database has now been queried, with the resulting data saved in the variable dataframe.  To verify we have queried successfully, we will print the head() of this resulting data frame.

In [12]:
dataframe.head()

   id              name  credits  instructor_id
0   1              Math        5              4
1   2           Science        5              2
2   3        Humanities        4              1
3   4       Programming       10              4
4   5  Creative Writing        4              5

We can utilize the same SQL engine to query our database in different ways

First, let's look at querying 2 tables together, connected by an FK relationship

We want to query for all school_db_course, as well as the name of the course instructor

In [19]:
query2 = """SELECT school_db_course.id, 
            school_db_course.name, 
            school_db_course.credits, 
            school_db_instructor.first_name, 
            school_db_instructor.last_name
            FROM
            school_db_course, school_db_instructor
            WHERE
            school_db_course.instructor_id = school_db_instructor.id"""
joined_df = pd.read_sql_query(query2,sql_engine)
joined_df.head()

   id          name  credits first_name   last_name
0   3    Humanities        4     Jackie     Daytona
1   8    Volleyball        3     Jackie     Daytona
2   2       Science        5      Colin    Robinson
3   9       History        4      Colin    Robinson
4   7  Self Defense        3  Guillermo  de la Cruz

In a similar vein, we can apply filtering logic to query for a more selective group of our data set

Below, we will query for students with a GPA between 2.0 and 3.0

In [21]:
query3 = """SELECT * FROM school_db_student
            WHERE gpa >= 2 AND gpa <= 3"""
filtered_df = pd.read_sql_query(query3,sql_engine)
filtered_df.head()

   id first_name   last_name  year  gpa
0   4      Molly      OBrien    12  3.0
1   6        Eli       Garak    10  3.0
2   7     Thomas       Riker    11  2.5
3  10        Sam  Rutherford     9  2.0

We can also implement tools like JOIN!  Below, we will use an INNER JOIN to combine three tables - student, course, and studentcourse - into one table where we'll see all student grades, their first and last name, and the name of the corresponding course!

In [26]:
query4 = """SELECT 
        school_db_studentcourse.grade AS Grade, 
        school_db_course.name AS Course, 
        school_db_student.first_name, 
        school_db_student.last_name
        FROM ((school_db_studentcourse
        INNER JOIN school_db_student ON school_db_studentcourse.student_id = school_db_student.id)
        INNER JOIN school_db_course ON school_db_studentcourse.course_id = school_db_course.id)"""
joined_df = pd.read_sql_query(query4,sql_engine)
joined_df.head()

  Grade            Course first_name last_name
0     A              Math       Jake     Sisko
1     A           Science       Jake     Sisko
2    A+  Creative Writing       Jake     Sisko
3    A+           Science      Keira     Nerys
4     A       Programming      Keira     Nerys

To insert new data into a MySQL database, first we will create a new DataFrame with the same structure as our database.  Then, we can use the to_sql() command to easily convert this to a record in MySQL!

In [35]:
# Creating a new DataFrame of the course to add
    # DataFrame values will still be in a LIST, even if it's a single entry
    # Note that we do NOT specify a field for ID - MySQL will add this for us!
new_course_df = pd.DataFrame(data = {"name":["Underwater Basket Weaving"],'credits':[8],'instructor_id':[3]})

# Using to_sql() to add the DataFrame to the MySQL database
    # Specifying the table name 'school_db_course'
    # Using our predefined sql_engine
    # As our table already exists, we will add the flag if_exists='append', so the new value will be appended to the existing table
    # DataFrames by default will add an 'index' field on creation.  
        # As this does NOT exist within our database, we must add the flag index=false to ignore that field
new_course_df.to_sql('school_db_course', sql_engine, if_exists='append', index=False)

1

Next, we will query our school_db_course table again to verify our changes were successful

Note in the below DataFrame we can see both the INDEX and ID columns displayed!

In [36]:
dataframe = pd.read_sql_query(query,sql_engine)
dataframe

    id                       name  credits  instructor_id
0    1                       Math        5              4
1    2                    Science        5              2
2    3                 Humanities        4              1
3    4                Programming       10              4
4    5           Creative Writing        4              5
5    6                  Economics        5              6
6    7               Self Defense        3              3
7    8                 Volleyball        3              1
8    9                    History        4              2
9   10                        Art        5              5
10  13  Underwater Basket Weaving        8              3